programming/cpp/code/cpp-code.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>cpp code</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">cpp code</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">cpp</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="cpp-examples/hello.html">hello world</a> 2
</li>
<li><a href="cpp-examples/account.html">account</a> 11 ; classes
</li>
<li><a href="cpp-examples/encoderh.html">encoder.h</a>, <a href="cpp-examples/encoder.html">encoder</a> 24
</li>
<li><a href="cpp-examples/complex.html">complex</a> 31
</li>
<li><a href="cpp-examples/factorial-iterative.html">factorial iterative</a> 32
</li>
<li><a href="cpp-examples/factorial-recursive.html">factorial recursive</a> 32
</li>
<li><a href="cpp-examples/fibonacci.html">fibonacci</a> 33
</li>
<li><a href="cpp-examples/array-example.html">array example</a> 35 ; arrays
</li>
<li><a href="cpp-examples/name_address.html">name_address</a> 35 ; arrays
</li>
<li><a href="cpp-examples/histogram.html">histogram</a> 37 ; arrays
</li>
<li><a href="cpp-examples/lotto.html">lotto</a> ; sorting
</li>
<li><a href="cpp-examples/stack.html">stack</a> 45
</li>
<li><a href="cpp-examples/palindrome.html">palindrome</a> 46 
</li>
<li><a href="cpp-examples/stack-template.html">stack</a> 47 ; class templates
</li>
<li>patient 49 ; array of objects
</li>
<li>hotelroom 50 ; sort array of objects
</li>
<li><a href="cpp-examples/student.html">student</a> 55 ; linked lists
</li>
<li>student search 56 ; linked list search
</li>
<li>course 58 ; pointers between classes
</li>
<li><a href="cpp-examples/interestAccount.html">interestAccount</a> 61 ; inheritance
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">idiots</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="idiots/idiots-code.html">idiots-code</a>
</li>
</ul>

<p>
<a href="../cpp.html">back</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
